{
  "projects": [
    {
      "id": "wishfull",
      "title": "Wishfull",
      "summary": "Make and share wishes",
      "description": "Every year my family celebrates Christmas together, which means buying presents for siblings, parents, kids, etc. Naturally, we want to get the perfect gift, and if we're honest, we'd really like to get good gifts ourselves! I figured a web site that enabled us to know what each person really wanted and see if anyone has bought it yet would be helpful. Turns out I was right - my family has been using Wishfull ever since!",
      "technologies": ["React", "Bootstrap", "Firebase"],
      "vid": "christian-jensen/wishfull-vid",
      "vidAlt": "Video showing the Wishfull web site being used",
      "link": "http://bit.ly/2CwLNpg"
    },
    {
      "id": "andale",
      "title": "Andale",
      "summary": "Get support fast",
      "description": "As a musician, I really enjoyed working at Musician's Friend. What I did not enjoy so much, however, was how tough it was to give customers the support they needed efficiently. With the vast array of musical instruments, brands and products that we were asked to support, information was sometimes hard to find. Thus, I created Andale - a single place for all the data my team needed, offering easy search functionality, interactive image galleries, and detailed specifications.",
      "technologies": ["Angular", "Bootstrap"],
      "vid": "christian-jensen/andale-vid",
      "vidAlt": "Video showing the Andale web site being used",
      "link": "http://bit.ly/2JapI15"
    },
    {
      "id": "createChefs",
      "title": "Create Chefs",
      "summary": "Cooking for kids",
      "description": "My mom is a great cook. She's been preparing homemade meals for me as long as I can remember, and I (almost) always love what she creates. So when she asked me to build her a web site for her child-oriented cooking classes, I was excited to both gain some real-world experience and give her a tangible \"thank you!\" Although my mother has since taken a break from these classes, the site is still usable. Prospective customers can easily sign up for an account, add as many children as they need to their account, and register each child for individual classes.",
      "technologies": ["React", "Bootstrap", "Firebase"],
      "vid": "christian-jensen/create-chefs-vid",
      "vidAlt": "Video showing the Create Chefs web site being used",
      "link": "http://bit.ly/2ypsxag"
    }
  ],
  "education": [
    {
      "id": "devMountain",
      "title": "DevMountain",
      "summary": "Web Dev Bootcamp",
      "description": "Based on the recommendation of a couple programming friends, I decided to go through DevMountain’s front end web development course. We started with some essential command line knowledge, moved on to basic HTML & CSS, then spent a considerable amount of time diving into JavaScript. After that, we started using frameworks and other tools like Angular, Bootstrap, and Firebase. As the course came to a close, we each submitted our own personal projects, and I was honored with the request to present mine on graduation night. After this, I was invited to attend the next cohort, which is where I was introduced to React. I am grateful for DevMountain because it increased not only my skills but my love for web developement as well.",
      "technologies": ["React", "Angular", "Bootstrap", "Firebase"],
      "img": "christian-jensen/devmountain-logo",
      "imgAlt": "DevMountain logo",
      "link": "http://bit.ly/2NY6bBB"
    },
    {
      "id": "paradigm",
      "title": "Paradigm",
      "summary": "Charter High School",
      "description": "I attended Paradigm High School from the second half of 11th grade through my senior year, and graduated with a GPA of 3.8.",
      "img": "christian-jensen/paradigm-building",
      "imgAlt": "Paradigm High School building"
    }
  ],
  "work history": [
    {
      "id": "deluxe",
      "title": "Deluxe",
      "summary": "Web Developer",
      "description": "Deluxe is a large corporation that made checks about 100 years ago. Since then, checks have fallen away from mainstream use, so they've turned to the digital market instead. As part of this technological advance, they aquired a small business called 180fusion, and it is this team that I joined in mid-2017 as the sole web developer. It is my responsibility to implement any and all changes on any of our clients web sites. Because our clients come from diverse backgrounds and differing styles, and because I was almost always working on existing sites using whichever platform the client preferred, I was exposed to a vast array of content management systems, coding styles, and development challenges. Anything from changing the meta description of a page to designing and coding a new WordPress site was ony my plate, and I am grateful for such a skill-stretching, eye-opening experience.",
      "img": "christian-jensen/deluxe-logo",
      "imgAlt": "Deluxe logo",
      "imgContainsTitle": true
    },
    {
      "id": "autopoint",
      "title": "AutoPoint",
      "summary": "Tech Support",
      "description": "When I graduated from DevMountain, I was still an employee at Musician's Friend. I really wanted a job more closely related to programming, so I took this job as a Technical Support Representative for an auto glass software application as a sort of stepping stone in my career. In this role, I was required to troubleshoot issues that auto shop personel were having with our software program, GlasPac. This was almost always being operated on Windows, though I did see a few Mac come through, and really helped me gain a better understanding of how computers work and how to make changes in the Windows operating system.",
      "img": "christian-jensen/autopoint-logo",
      "imgAlt": "AutoPoint logo",
      "imgContainsTitle": true
    },
    {
      "id": "musiciansFriend",
      "title": "Musician's Friend",
      "summary": "Tech Support",
      "description": "I started out with Musician's Friend as a Customer Support Representative, but shortly after was promoted to a Technical Support Representative in the warranty department. My basic responsibilities involved diagnosing issues that customers were having with their gear, coming up with a solution, and fulfilling necessary repair and replacement orders. It is during this time that I attended DevMountain, learned Angular, and created Andale - a proprietary web site that enabled my team to quickly retrieve relevant product information.",
      "img": "christian-jensen/musicians-friend-logo",
      "imgAlt": "Musician's Friend logo",
      "imgContainsTitle": true
    }
  ],
  "tutorials": [
    {
      "id": "useState",
      "title": "React Hooks - useState",
      "summary": "The useState React Hook in a simple counter",
      "description": "React hooks are currently in alpha stage, and they're really fun to use! This tutorial covers the most basic hook - useState.",
      "img": "christian-jensen/screenshot-tutorial-useState",
      "imgAlt": "Screenshot of an online tutorial for the React useState hook",
      "link": "https://scrimba.com/p/pwQZ6tV/cEE4qfg"
    },
    {
      "id": "useRef",
      "title": "React Hooks - useRef",
      "summary": "How to use the useRef hook to mutate the DOM",
      "description": "The API for refs in React has changed multiple times, but with a hook it's better than ever, and this quick tutorial shows how easy it is to use.",
      "img": "christian-jensen/screenshot-tutorial-react-hooks-ref",
      "imgAlt": "Screenshot of an online tutorial for the React useRef hook",
      "link": "https://scrimba.com/p/pwQZ6tV/cnVy7AN"
    },
    {
      "id": "useLayoutEffect",
      "title": "React Hooks - useLayoutEffect",
      "summary": "What is the useLayoutEffect hook for, and when might we use it?",
      "description": "One hook I don't hear addressed often is useLayoutEffect. This tutorial quickly goes over when and why you may want to use the useLayoutEffect hook.",
      "img": "christian-jensen/screenshot-tutorial-useLayoutEffect",
      "imgAlt": "Screenshot of an online tutorial for the React useLayoutEffect hook",
      "link": "https://scrimba.com/p/pwQZ6tV/c68wGu2"
    }
  ]
}
