{
  "projects": [
    {
      "id": "wishfull",
      "title": "Wishfull",
      "summary": "Make and share wishes",
      "description": "Every year my family celebrates Christmas together, which means buying presents for siblings, parents, kids, etc. Naturally, we want to get the perfect gift, and if we're honest, we'd really like to get good gifts ourselves! I figured a web site that enabled us to know what each person really wanted and see if anyone has bought it yet would be helpful. Turns out I was right - my family has been using Wishfull ever since!",
      "technologies": ["React", "Bootstrap", "Firebase"],
      "img": "https://source.unsplash.com/random/500x350",
      "alt": "Random image"
    },
    {
      "id": "andale",
      "title": "Andale",
      "summary": "Get support fast",
      "description": "As a musician, I really enjoyed working at Musician's Friend. What I did not enjoy so much, however, was how tough it was to give customers the support they needed efficiently. With the vast array of musical instruments, brands and products that we were asked to support, information was sometimes hard to find. Thus, I created Andale - a single place for all the data my team needed, offering easy search functionality, interactive image galleries, and detailed specifications.",
      "technologies": ["React", "Bootstrap", "Firebase"],
      "img": "https://source.unsplash.com/random/500x350",
      "alt": "Random image"
    },
    {
      "id": "createChefs",
      "title": "Create Chefs",
      "summary": "Cooking for kids",
      "description": "My mom is a great cook. She's been preparing homemade meals for me as long as I can remember, and I (almost) always love what she creates. So when she asked me to build her a web site for her child-oriented cooking classes, I was excited to both gain some real-world experience and give her a tangible \"thank you!\" Although my mother has since taken a break from these classes, the site is still usable. Prospective customers can easily sign up for an account, add as many children as they need to their account, and register eacg child for individual classes.",
      "technologies": ["React", "Bootstrap", "Firebase"],
      "img": "https://source.unsplash.com/random/500x350",
      "alt": "Random image"
    }
  ]
}
